Repository: steinm/pxlib
Catalog: po/*.po
Languages: es

source: Must set all memory management functions or none.
es: Debe establecer todas las funciones de manejo de memoria o ninguna.

source: Could not allocate memory for PX object.
es: No se puede asignar memoria para el Objeto PX.

source: Did not pass a paradox database.
es: No se pasó una base de datos de paradox.

source: Allocate memory for self build internal primary index.
es: Asignar memoria para la estructura del índice primario interno.

source: Could not allocate memory for self build internal index.
es: No se puede asignar memoria para la estructura del índice interno.

source: Could not get head of data block nr. %d.
es: No se puede obtener la cabecera del bloque de datos (data block) nr. %d.

source: Unable to get header.
es: Incapaz de colocar cabecera.

source: Could not open paradox database.
es: No se puede abrir base de datos de paradox.

source: Allocate memory for database header.
es: Asignar memoria para la cabecera de la base de datos.

source: Unable to put header.
es: Incapaz de colocar cabecera.

source: File is not writable. Setting '%s' has no effect.
es: Archivo no es escribible. Configuración '%s' no tiene efecto.

source: There is no such value like '%s' to set.
es: No hay valor como '%s' para establecer.

source: No such value name.
es: Nombre Invalido.

source: Header of file has not been read.
es: Cabecera del archivo no ha sido leida.

source: Target encoding could not be set.
es: El objetivo a Codificar no puede ser establecido.

source: Library has not been compiled with support for reencoding.
es: Libraria no ha sido compilada con soporte para recodificar (reencoding).

source: Input encoding could not be set.
es: Entrada para codificación no puede ser establecida.

source: No such parameter name.
es: Nombre del Parametro invalido.

source: Cannot add a primary index to a database which is not of type 'IndexDB'.
es: No se puede agregar un índice primario a la base de datos el cual no es de tipo 'IndexDB'.

source: Did not pass a paradox index file.
es: No se pasó un archivo de índice de paradox.

source: Header of index file has not been read.
es: Cabecera del archivo del índice no ha sido leida.

source: Did not pass a paradox primary index file.
es: No se pasó archivo de índice primario de paradox.

source: Primary index file has no index data.
es: Archivo de índice primario no tiene datos de índice.

source: Index file is for database with %d records, but database has %d records.
es: Archivo de índice para la base de datos tiene %d registros, pero la base de datos tiene %d registros.

source: Allocate memory for primary index data.
es: Asignar memoria para datos de índice primario.

source: Could not allocate memory for primary index data.
es: No se puede asignar memoria para datos de índice primario.

source: Allocate memory for data of index record.
es: Asignar memoria para los datos del registro índice.

source: Inconsistency in length of primary index record. Expected %d but calculated %d.
es: Inconsistente en tamaño del registro de índice primario. Esperado %d pero calculado %d.

source: Allocate memory for data part of index record.
es: Asignar memoria para parte de datos del registro de índice.

source: Could not read record no. %d of primary index data.
es: No se puede leer No. de registro %d de datos de índice primario.

source: The number of records coverd by index level 2 is unequal to level 1.
es: El Número de registros cubiertos por el Nivel 2 de índice no es igual al Nivel 1.

source: Could not fseek start of first data block.
es: No se puede ubicar (fseek) en el inicio del primer bloque de datos.

source: Could not read datablock header.
es: No se puede leer cabecera del bloque de datos (datablock).

source: File has no header.
es: Archivo no tiene cabecera.

source: Record number out of range.
es: Número de registro fuera de rango.

source: Could not fseek start of record data.
es: No se puede ubicar (fseek) al inicio de los datos del registro.

source: Could not read data of record.
es: No se puede leer datos del registro.

source: Could not write new data block.
es: No se puede escribir nuevo bloque de datos.

source: Inconsistency in writing data block. Expected data block nr. %d, but got %d.
es: Inconsistencia en escribir bloque de datos. Bloque de datos esperado nr. %d, pero se obtuvo %d.

source: Inconsistency in writing record into data block. Expected record nr. %d, but got %d. %dth record. %dth data block. %d records per block.
es: Incosistencia en escribir registros dentro del bloque de datos. Registros nr. %d, pero se obtuvieron %d. %dth registro. %dth bloque de datos. %d registros por bloue.

source: Position of record has been recalculated. Requested position was %d, new position is %d.
es: Posición de registros no ha sido recalculado. Posición requerida fué %d, posición nueva es %d.

source: Blob data is not contained in record and a blob file is not set.
es: Datos del Blob no estan contenidos en el registro y un archivo blob no esta asignado.

source: Field number out of range.
es: Número de campo fuera de rango.

source: Target encoding already set.
es: Objetivo a codificar realmente establecido.

source: Input encoding already set.
es: Codificación de Entrada ya establecida.

source: Could not read blob pointer.
es: No se puede leer puntero del blob.

source: Could not allocate memory for blob.
es: No se puede asignar memoria para el blob.

source: No paradox document associated with blob file.
es: No existe documento de paradox asociado con el archivo blob.

source: Unable to get header of blob file.
es: Incapaz de obtener cabecera del archivo blob.

source: Allocate memory for header of blob file.
es: Asignar memoria para la cabecera del archivo blob.

source: Could not allocate memory for header of blob file.
es: No se puede asignar memoria para la cabecera del archivo blob.

source: Could not open blob file '%s' for writing.
es: No se puede abrir archivo blob '%s' para esritura.

source: Could not create new blob file object.
es: No se puede crear nuevo objeto de archivo blob.

source: Could not open blob file.
es: No se puede abrir archivo blob.

source: Could not create blob file.
es: No se puede crear archivo blob.

source: Did not pass a blob file.
es: No se pasó un archivo blob.

source: Makes no sense to read blob with 0 or less bytes.
es: No tiene sentido leer blob con 0 o menos bytes.

source: Could not fseek start of blob.
es: No se puede ubicar (fseek) al inicio del blob.

source: Could not read head of blob data.
es: No se puede leer cabecera de datos blob.

source: Trying to read blob data from 'header' block.
es: Intentando leer datos blob de bloque 'cabecera' (header).

source: Trying to read blob data from a 'free' block.
es: Intentado leer datos blob de un bloque 'libre' (free).

source: Offset points to a single blob block but index field is not 0xff.
es: Offset apunta para un bloque de blob sencillo pero el campo del índice no es 0xff.

source: Could not read remaining head of single data block.
es: No se puede leer cabecera restante de un bloque de datos sencillo.

source: Blob does not have expected size (%d != %d).
es: Blob no tiene el tamaño esperado (%d != %d).

source: Could not read all blob data.
es: No se pueden leer todos los blob esperados.

source: Could not read remaining head of suballocated block.
es: No se puede leer cabecera restante de un bloque subasignado (suballocated block).

source: Could not fseek blob pointer.
es: No se puede ubicar (fseek) puntero del blob.

source: Allocate memory for field data.
es: Asignar memoria para los datos del campo.

source: Paradox database has no blob file.
es: Base de Datos Paradox no tiene archivo blob.

source: Could not write header of blob data to file.
es: No se puede escribir cabecera de los datos blob en el archivo.

source: Could not write blob data to file.
es: No se puede escribir los datos blob en el archivo.

source: Could not write remaining of a type 3 block.
es: No se puede escribir restante de un bloque de tipo 3.

source: Could not go to table entry for the blob data.
es: No se puede ir a la entrada de la tabla para los datos blob.

source: Could not write table entry for blob data to file.
es: No se puede escribir entrada de tabla para los datos blob en el archivo.

source: Allocate memory for timestamp string.
es: Asignar memoria para la cadena timestamp.

source: Could not allocate memory for timestamp string.
es: No se puede asignar memoria para la cadena.

source: Allocate memory for document header.
es: Asignar memoria para la cabecera del documento.

source: Could not allocate memory for document header.
es: No se puede asignar memoria para la cabecera del documento.

source: Could not read header from paradox file.
es: No se puede leer cabecera del archivo de paradox.

source: Paradox file has unknown file type (%d).
es: Archivo de paradox tiene un tipo de archivo desconocido (%d).

source: Paradox file has unknown table size (%d).
es: Archivo de Paradox tiene un tamaño de tabla desconocido (%d).

source: Paradox file has unknown file version (0x%X).
es: Archivo de Paradox tiene una version de archivo desconocida (0x%X).

source: Paradox file has zero record size.
es: Archivo de Paradox tiene tamaño de registro igual a cero.

source: Paradox file has zero header size.
es: Archivo de Paradox tiene el tamaño de la cabecera igual a cero.

source: Could not get memory for field definitions.
es: No se puede asignar memoria para la definición del campo.

source: Could not go to the beginning paradox file.
es: No se puede ir a el comienzo del archivo de Paradox.

source: Could not write header of paradox file.
es: No se puede escribir cabecera del archivo de Paradox.

source: Could not write field specification.
es: No se puede escribir especificación del campo.

source: Could not write pointer to tablename.
es: No se puede escribir puntero para el nombre de la tabla.

source: Could not write pointers to field names.
es: No se puede escribir puntero para el los nombres de los campos.

source: Could not write tablename.
es: No se puede escribir el nombre de la tabla.

source: Could not write field name %d.
es: No se puede escribir el nombre del campo %d.

source: Field name is NULL.
es: Nombre del Campo es Nulo (NULL).

source: Could not write field number %d.
es: No se puede escribir el número del campo %d.

source: Could not write field numbers.
es: No se puede escribir números de campos.

source: Could not fill header with zeros.
es: No se puede llenar la cabecera con ceros.

source: Trying to insert data block after block number %d, but file has only %d blocks.
es: Intentando insertar bloque de datos después de número de bloque %d, pero el archivo tiene solo %d bloques.

source: You did not pass a valid block number.
es: No has pasado un número de bloque valido.

source: Could not get head of data block before the new block.
es: No se puede obtener la cabecera del bloque de datos antes del nuevo bloque.

source: Could not get head of data block after the new block.
es: No se puede obtener la cabecera del bloque de datos después del bloque nuevo.

source: Could not write new data block header.
es: No se puede escribir cabecera del bloque de datos nuevo.

source: Could not write empty data block.
es: No se puede escribir bloque de datos vacio.

source: Could not update data block header before new block.
es: No se puede actualizar cabecera de bloque de datos antes del nuevo bloque.

source: Could not update datablock header after new block.
es: No se puede actualizar cabecera de bloque de datos despúes del nuevo bloque.

source: Unable to write file header.
es: Incapaz de escribir cabecera de archivo.

source: Could not read data block header.
es: No se puede leer cabecera del bloque de datos.

source: Could not write updated data block header.
es: No se puede actualizar la cabecera del bloque de datos.

source: Could not fseek to start of new record.
es: No se puede ubicar (fseek) al inicio del nuevo registro.

source: Could not write record.
es: No se puede escribir registro.

source: Blob file has no associated paradox database.
es: Archivo Blob no tiene base de datos de Paradox asociada.

source: Could not write remaining blob file header.
es: No se puede escribir cabecera del archivo blob restante.

source: Aiii, no more space for new memory block.
es: Aiii, No existe mas espacio para el nuevo bloque de memoria.

source: Aiii, did not find memory block at 0x%X to enlarge.
es: Aiii, No se puede encontrar bloque de memoria en 0x%X para aumentar.

source: Aiii, did not find memory block at 0x%X to free.
es: Aiii, No se puede encontrar bloue de memoria 0x%X para liberar.

source: %d. Memory at address 0x%X (%d) not freed: '%s'.
es: %d. Memoria en dirección 0x%X (%d) no liberado: '%s'.

source: Remaining unfreed memory: %d Bytes.
es: Memoria sin liberar restante : %d Bytes.

source: Max. amount of memory used: %d Bytes.
es: Max. monto de memoria usada : %d Bytes.

source: Passed NULL string to px_strdup().
es: Cadena Pasada Nula (NULL) para px_strdup().

source: Could not allocate memory for string.
es: No se puede asignar memoria para la cadena.

source: Allocate memory for io stream.
es: Asignar memoria para flujo de entrada/salida (e/s).
